# Дана строка, состоящая из символов, например, 'abcde'. Проверьте, что
# первым символом этой строки является буква 'a'. Если это так - выведите
# 'yes', в противном случае выведите 'no'.


di = "abcde"
# print(di[0])
if 'a' in di[0]:
    print("YES")
else:
    print("NO")